{
  "cells":[
    {
      "cell_type":"markdown",
      "source":[
        "# Баскетбол\n",
        "**выполнил Шевченко А.А., группа БВТ 1903**"
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "**Задача**\n",
        "\n",
        "Перед каждым сезоном НБА проходит драфт, то есть церемония выбора игроков командами.\n",
        "\n",
        "Перед драфтом скаутские службы команд детально изучают потенциальных новичков. Одна из команд поручила вам написать программу для обработки собранных данных в соответствии с внутрикомандными стандартами.\n",
        "\n",
        "Каждый из новичков до этого провёл как минимум один сезон в студенческих лигах, так что для каждого игрока известны пять основных целочисленных параметров:\n",
        "\n",
        "● Рост игрока – ожидаемый диапазон от 190 до 220 см.\n",
        "\n",
        "● Размах рук (иначе говоря, wingspan) – ожидаемый диапазон от 200 до 250 см.\n",
        "\n",
        "● Среднее количество очков за матч – ожидаемый диапазон от 10 до 20.\n",
        "\n",
        "● Среднее количество подборов за матч – ожидаемый диапазон от 2 до 6.\n",
        "\n",
        "● Среднее количество передач за матч – ожидаемый диапазон от 3 до 7.\n",
        "\n",
        "Таким образом, каждый из параметров может оказаться ниже ожидаемого диапазона, в нижней половине ожидаемого диапазона, в верхней половине ожидаемого диапазона (середина входит в верхнюю половину) и выше ожидаемого диапазона.\n",
        "\n",
        "Перед драфтом требуется распределить игроков по следующим категориям:\n",
        "\n",
        "● уникальный игрок (таких ещё называют «единорогами» — unicorn) с сочетанием выдающихся физических данных и игровых навыков;\n",
        "\n",
        "● игрок, достойный выбора в первом раунде;\n",
        "\n",
        "● игрок, достойный выбора во втором раунде;\n",
        "\n",
        "● игрок, которого не стоит выбирать вообще.\n",
        "\n",
        "Если у игрока три параметра выше ожидаемого диапазона, причём среди них обязательно есть рост или размах рук, то игрок считается «единорогом» (категория 0)\n",
        "\n",
        "Игрока рекомендуется выбирать в первом раунде драфта (категория 1), если верно одно из следующих утверждений:\n",
        "\n",
        "● У игрока два параметра выше ожидаемого диапазона и ещё один – как минимум в верхней половине ожидаемого диапазона.\n",
        "\n",
        "● У игрока все параметры как минимум в ожидаемом диапазоне и не менее трёх – как минимум в верхней половине.\n",
        "\n",
        "Игрока рекомендуется выбирать во втором раунде драфта (категория 2), если верно одно из следующих утверждений:\n",
        "\n",
        "● У игрока один параметр выше ожидаемого диапазона и ещё один — как минимум в верхней половине ожидаемого диапазона.\n",
        "\n",
        "● У игрока три параметра как минимум в верхней половине ожидаемого диапазона.\n",
        "\n",
        "В остальных случаях тратить выбор драфта на этого игрока не рекомендуется (категория 3).\n",
        "\n",
        "Вам заданы параметры некоторых из 32 игроков текущего драфта (для объективности имена игроков не указаны). Ваша задача – для каждого игрока определить категорию, под которую он подпадает для вашей команды на драфте."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"code",
      "source":[
        "players = int(input()) # Вводим кол-ва игроков\n",
        "characters = [[0] * 5  for i in range(players)] \n",
        "for i in range(players): # массив ввода характеристик игроков\n",
        "    for j in range(5):\n",
        "        characters[i][j] = int(input())\n",
        "# данные по стандарту\n",
        "pok_min=[190, 200, 10, 2, 3]\n",
        "pok_middle=[210, 225, 15, 4, 5]\n",
        "pok_max=[220, 250, 20, 6, 7]\n",
        "print(characters) # проверка\n",
        "for i in range(players): \n",
        "    great = 0\n",
        "    good = 0\n",
        "    norm = 0\n",
        "    for j in range(5): # проверка на категории \n",
        "        if characters[i][j] > pok_max[j]:\n",
        "            great += 1\n",
        "        if pok_max[j] >= characters[i][j] >= pok_middle[j]:\n",
        "            good += 1\n",
        "        if pok_middle[j] > characters[i][j] > pok_min[j]:\n",
        "            norm += 1\n",
        "    if great >= 3 and (characters[i][0] > pok_max[0] or characters[i][1] > pok_max[0]): # вывод категорий игроков\n",
        "        print(0)\n",
        "    elif great >=2 and good >= 1 or norm == 5 and good >= 3:\n",
        "        print(1)\n",
        "    elif great >=1 and good >=1 or good >=3:\n",
        "        print(2)\n",
        "    else: \n",
        "        print(3)"
      ],
      "execution_count":null,
      "outputs":[
        
      ],
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "## Вывод: В ходе этой практической работы я выполнил задачу по сортировке игроков в баскетбол."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    }
  ],
  "metadata":{
    
  },
  "nbformat":4,
  "nbformat_minor":0
}