{
  "cells":[
    {
      "cell_type":"markdown",
      "source":[
        "# Задачи на дом от 27 февраля\n",
        "**выполнил Шевченко А.А., группа БВТ 1903**"
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "### Задача 1. \"Думский регламент\"\n",
        "В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n",
        "- В начале заседания никаких законопроектов на повестке дня не стоит.\n",
        "- Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n",
        "- При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n",
        "- Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n",
        "- В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n",
        "\n",
        "Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше.\n",
        "\n",
        "\n",
        "Первая строка входных данных содержит одно целое число K – количество строк в записи сессии (1 ≤ K ≤ 1000). Каждая строка соответствует одному из двух событий:\n",
        "- Add x – партия x внесла на голосование законопроект.\n",
        "- Vote x – прошло голосование за документ, внесённый партией x.\n",
        "\n",
        "Здесь x – строчная буква английского алфавита от «a» до «z», задающая партию.\n",
        "\n",
        "\n",
        "Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"code",
      "source":[
        "def task01(events):\n",
        "    stack = []\n",
        "    for e in events:\n",
        "        cmd, party = e.split()\n",
        "        if cmd == \"Add\":\n",
        "            stack.append(party)\n",
        "        elif stack.pop() != party:\n",
        "            return \"No\"\n",
        "    return \"Yes\" if len(stack) == 0 else \"No\"\n",
        "\n",
        "print (task01([\"Add x\", \"Add y\", \"Vote y\", \"Vote x\"]))\n",
        "print (task01([\"Add x\", \"Add x\", \"Vote y\", \"Vote x\"]))\n",
        "print (task01([\"Add x\", \"Add y\"]))\n",
        "print (task01([\"Add x\", \"Vote x\"]))"
      ],
      "execution_count":null,
      "outputs":[
        
      ],
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "**Задача 2. \"Правильный подмногоугольник\"**\n",
        "\n",
        "Задан правильный N-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n",
        "\n",
        "Входные данные содержат одно целое число N (3 ≤ N ≤ 10^12).\n",
        "\n",
        "Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"code",
      "source":[
        "def task02(N):\n",
        "    for i in range(3, int(N**.5)+1):  #максимальное количество проверок 10^6  \n",
        "        if N % i == 0: \n",
        "            return i\n",
        "    if N > 4 and N % 2 == 0:\n",
        "        return int(N \/ 2)\n",
        "    return N\n",
        "\n",
        "print (task02(3))\n",
        "print (task02(11))\n",
        "print (task02(16))"
      ],
      "execution_count":null,
      "outputs":[
        
      ],
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "**Задача 3. \"Определение делителя\"**\n",
        "\n",
        "На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из N десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления B, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его D), а также число X, большее 1 и меньшее D, являющееся делителем D. При этом B и X не должны превосходить 10^9. По заданной строке десятичных цифр найдите любую пару чисел B и X, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n",
        "\n",
        "Входные данные состоят из непустой строки длиной до 3*10^6 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n",
        "\n",
        "Если решение существует, выведите два числа – основание системы счисления B и делитель X, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ B, X ≤ 10^9. Если решения не существует, выведите –1."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    },
    {
      "cell_type":"code",
      "source":[
        "def task03(s):\n",
        "    if len(s) == 1:\n",
        "        res = [0,0,0,2,0,2,0,2,3][int(s)-1]\n",
        "        if res:\n",
        "            return 10, res\n",
        "        return -1\n",
        "    S = sum(map(int, s))\n",
        "    if S == 1:\n",
        "        return 10, 2\n",
        "    return S + 1, S\n",
        "\n",
        "print (task03('5'))\n",
        "print (task03('8'))\n",
        "print (task03('10'))\n",
        "print (task03(\"19\"))"
      ],
      "execution_count":null,
      "outputs":[
        
      ],
      "metadata":{
        
      }
    },
    {
      "cell_type":"markdown",
      "source":[
        "## Вывод: В ходе данной практической я реализовал: Думский регламент, Правильный подмногоугольник и Определение делителя."
      ],
      "attachments":{
        
      },
      "metadata":{
        
      }
    }
  ],
  "metadata":{
    
  },
  "nbformat":4,
  "nbformat_minor":0
}